Revit 2027 API
RailTransitionOption Enumeration
 The transition type of the continuous rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailTransitionOption
Public Enumeration RailTransitionOption
public enum class RailTransitionOption
type RailTransitionOption
Members
Member name | Value | Description
Gooseneck | 1 |  Gooseneck.
None | 0 |  No transition.
Simple | 2 |  Simple
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace